ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    // Init BLE connection library
    if ( NRF_SUCCESS != ble_conn_params_init( &conn_par_init ))
    {
        status = eBLE_P_ERROR;

        BLE_P_DBG_PRINT( "BLE_P: BLE connection parameters library init error!" );
        BLE_P_ASSERT( 0 );
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
 * @brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *
 * @note    All this function does is to disconnect. This could have been done by simply
 *          setting the disconnect_on_fail config parameter, but instead we use the event
 *          handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
 ////////////////////////////////////////////////////////////////////////////////
static void ble_p_on_conn_pars_evt_hndl(ble_conn_params_evt_t * p_evt)
{
    // Negotiation procedure failed
    if ( BLE_CONN_PARAMS_EVT_FAILED == p_evt->evt_type )
    {
        if ( NRF_SUCCESS != sd_ble_gap_disconnect( g_ble_p.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE ))
        {
            // TODO: How to handle this error?

            BLE_P_DBG_PRINT( "BLE_P: Disconnection error! (sd_ble_gap_disconnect)" );
            BLE_P_ASSERT( 0 );
        }
    }
}




static ble_p_status_t ble_p_service_init(void)
{
    ble_p_status_t  status = eBLE_P_OK;
    ble_uuid_t      hrs_uuid    = {0};
    uint16_t        hrs_handle  = 0;


    #if 0
        ///////////////////////////////////////////////////////////////////////////////////
        // Assing UUID 
        //BLE_UUID_BLE_ASSIGN( hrs_uuid, BLE_UUID_HEART_RATE_SERVICE );
    
        // Or EQUIVALENT
        hrs_uuid.type = BLE_UUID_TYPE_BLE;
        hrs_uuid.uuid = BLE_UUID_HEART_RATE_SERVICE;
        ///////////////////////////////////////////////////////////////////////////////////


        // Register service
        if ( NRF_SUCCESS != sd_ble_gatts_service_add( BLE_GATTS_SRVC_TYPE_PRIMARY, &hrs_uuid, &hrs_handle ))
        {
            // TODO: Change error status...
            BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
        }

    
        ///////////////////////////////////////////////////////////////////////////////////
        // Add characteristics to service
    
        ble_add_char_params_t       char_params     = {0};


        uint8_t init_data[5] = { 0, 1, 2, 3, 4 };


        char_params.uuid                = BLE_UUID_HEART_RATE_MEASUREMENT_CHAR;
        char_params.max_len             = 20;
        char_params.init_len            = 5;
        char_params.is_var_len          = true;
        char_params.char_props.notify   = 1;
        char_params.cccd_write_access   = SEC_OPEN;
        char_params.p_init_value        = (uint8_t*) &init_data;



        // Register characteristics
        if ( NRF_SUCCESS != characteristic_add( hrs_handle, &char_params, &char_handles ))
        {
            // TODO: Change error status...
            BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
        }
    #endif





    ////////////////////////////////////////////////////////////////////////////////////////////////////
    //          HOW TO MAKE CUSTOM SERVICE AND CHARACTERISTICS ???????????????

    uint32_t            err_code;
    ble_uuid_t          char_uuid;
    ble_uuid128_t       base_uuid = THERMOSTAT_SERVICE_BASE;
    uint16_t            custom_service_handle  = 0;


    char_uuid.uuid      = THERMOSTAT_SERVICE_UUID;

    if ( NRF_SUCCESS != sd_ble_uuid_vs_add( &base_uuid, &char_uuid.type ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }

    // Register service
    if ( NRF_SUCCESS != sd_ble_gatts_service_add( BLE_GATTS_SRVC_TYPE_PRIMARY, &char_uuid, &custom_service_handle ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }


    // Add RX characteristics
    ble_add_char_params_t rx_char_params = {0};

    rx_char_params.uuid                     = BLE_THERMOSTAT_RX_CHARACTERISTIC;
    rx_char_params.uuid_type                = char_uuid.type;
    rx_char_params.init_len                 = sizeof(uint8_t);
    rx_char_params.max_len                  = 250;
    rx_char_params.is_var_len               = true;
    rx_char_params.char_props.write         = 1;
    rx_char_params.char_props.write_wo_resp = 1;
    rx_char_params.read_access              = SEC_OPEN;
    rx_char_params.write_access             = SEC_OPEN;
    rx_char_params.cccd_write_access        = SEC_OPEN;

    // Register characteristics
    if ( NRF_SUCCESS != characteristic_add( custom_service_handle, &rx_char_params, &rx_char_handles ))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" ); 
    }

    
    // Add Tx characteristics
    ble_add_char_params_t tx_char_params = {0};

    tx_char_params.uuid                     = BLE_THERMOSTAT_TX_CHARACTERISTIC;
    tx_char_params.uuid_type                = char_uuid.type;
    tx_char_params.init_len                 = sizeof(uint8_t);
    tx_char_params.max_len                  = 250;
    tx_char_params.is_var_len               = true;
    tx_char_params.char_props.write         = 0;
    tx_char_params.char_props.write_wo_resp = 0;
    tx_char_params.char_props.read          = 0;
    tx_char_params.char_props.notify        = 1;
    tx_char_params.read_access              = SEC_OPEN;
    tx_char_params.write_access             = SEC_OPEN;
    tx_char_params.cccd_write_access        = SEC_OPEN;

    // Register characteristics
    if ( NRF_SUCCESS != characteristic_add( custom_service_handle, &tx_char_params, &tx_char_handles))
    {
        // TODO: Change error status...
        BLE_P_DBG_PRINT( "BLE_P: SoftDevice enable error!" );
    }

