ZiGaMi/nRF5_nRF52840_DevBoard/src/drivers/peripheral/ble/ble_p.c
    return status;
}








////////////////////////////////////////////////////////////////////////////////
/**
* @} <!-- END GROUP -->
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*@addtogroup BLE_P_API
* @{ <!-- BEGIN GROUP -->
*
* 	Following function are part of BLE Peripheral API.
*/
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral Initialize
*
* @brief    BLE peripheral module creates custom service and with two 
*           characteristics:
*
*               1. TX Characteristics: for pushing data to client
*               2. RX Characteristics: for receiveing data from client
*
*           Basic client-server model:
*
*                           write to RX characteristic
*               CLIENT -----------------------------------> SERVER
*        (central BLE device)                        (peripheral BLE device)
*
*
*                        notification to TX characteristic
*               CLIENT <----------------------------------- SERVER
*        (central BLE device)                        (peripheral BLE device)
*
*
*           Implemented communication sheme is emulating simple UART interface.
*
*       
* @note     TX Characteristics is defined as notification, therefore client
*           must first enable CCCD (Client Characteristics Configuration Descriptor)
*           before it can receive notifications!
*
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_init(void)
{
    ble_p_status_t status = eBLE_P_OK;

    // Init Rx buffer
	if ( eRING_BUFFER_OK != ring_buffer_init( &g_rx_buf, BLE_P_RX_BUF_SIZE, &g_rx_buf_attr ))
	{
		status = eBLE_P_ERROR;
	}

    // Init BLE stack
    status |= ble_p_stack_init();

    // Init GAP (connection parameters)
    status |= ble_p_gap_init();
    
    // Init GATT
    status |= ble_p_gatt_init();
    
    // Init advertisement
    status |= ble_p_adv_init();

    // Init BLE connection library
    status |= ble_p_conn_init();

    // Init services
    status |= ble_p_service_init();

    // Init success
    if ( eBLE_P_OK == status )
    {
        gb_is_init = true;

        // Start advertising     
        status = ble_p_adv_start();
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral get init status
*
* @param[out] 	p_is_conn   - Connection status, true if initiated
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_is_init (bool * const p_is_init)
{
    ble_p_status_t status = eBLE_P_OK;

    if ( NULL != p_is_init )
    {
        *p_is_init = gb_is_init;
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;  
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral get connection status
*
* @param[out] 	p_is_conn   - Connection status, true if connected
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_is_connected(bool * const p_is_conn)
{
    ble_p_status_t status = eBLE_P_OK;

    if ( NULL != p_is_conn )
    {
        if ( g_ble_p.conn_handle == BLE_CONN_HANDLE_INVALID )
        {
            *p_is_conn = false;
        }
        else
        {
            *p_is_conn = true; 
        }
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral start advertising
*
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_adv_start(void)
{
    ble_p_status_t  status          = eBLE_P_OK;
    bool            is_connected    = false;

    BLE_P_ASSERT( true == gb_is_init );

    // Get connection flag
    ble_p_is_connected( &is_connected );

    if (    ( true == gb_is_init )
        &&  ( false == g_ble_p.is_adv )
        &&  ( false == is_connected ))
    {
        // Start advertisement
        if ( NRF_SUCCESS != ble_advertising_start( &g_adv_instance, BLE_ADV_MODE_FAST ))
        {
            status = eBLE_P_ERROR;
    
            BLE_P_DBG_PRINT( "BLE_P: Advertisement start error!" ); 
        }
    }
    else
    {
        status = eBLE_P_ERROR;
    }

    return status;
}

////////////////////////////////////////////////////////////////////////////////
/**
*		BLE Peripheral stop advertising
*
* @note     It is recommended to setup advertise duration rather that
*           calling that function as BLE Advertisement library don't 
*           really support advertisement stop.
*
* @return 		status		- Status of operation
*/
////////////////////////////////////////////////////////////////////////////////
ble_p_status_t ble_p_adv_stop(void)
{
    ble_p_status_t  status          = eBLE_P_OK;
    bool            is_connected    = false;

    BLE_P_ASSERT( true == gb_is_init );

    // Get connection flag
    ble_p_is_connected( &is_connected );

    if (    ( true == gb_is_init )
        &&  ( true == g_ble_p.is_adv )
        &&  ( false == is_connected ))
    {
        // Stop advertisement library
        if ( NRF_SUCCESS != ble_advertising_start( &g_adv_instance, BLE_ADV_MODE_IDLE ))
        {
            status = eBLE_P_ERROR;
        
            BLE_P_DBG_PRINT( "BLE_P: BLE adv stop error!" ); 
        }

        // Stop advertisement diretly via SoftDevice
        if ( NRF_SUCCESS != sd_ble_gap_adv_stop( g_adv_instance.adv_handle ))
        {
            status = eBLE_P_ERROR;
        
            BLE_P_DBG_PRINT( "BLE_P: SD adv stop error!" ); 
        }
    }
    else
    {
        status = eBLE_P_ERROR;
    }

